Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sf_ctrl.c
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_REGION_HW_KEY_EN, hwKey);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_REGION_START, startAddr / 1024);
  /* sf_aes_end =1 means 1,11,1111,1111 */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_REGION_END, endAddr / 1024);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_REGION_EN, enable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_REGION_LOCK, locked);

  BL_WR_REG(regionRegBase, SF_CTRL_SF_AES_CFG, tmpVal);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Serial flash controller set AES key
                                                                                *
                                                                                * @param  region: region number
                                                                                * @param  key: key data pointer
                                                                                * @param  keyType: flash controller AES key type:128 bits,192 bits or 256 bits
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Set_Key(uint8_t region, uint8_t *key, SF_Ctrl_AES_Key_Type keyType) {
  /* Do flash key eco*/
  uint32_t regionRegBase = SF_Ctrl_Get_AES_Region(SF_CTRL_BASE, region);
  uint32_t tmpVal, i = 0;

  /* Check the parameters */
  CHECK_PARAM(IS_SF_CTRL_AES_KEY_TYPE(keyType));

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_AES);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_MODE, keyType);
  BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_AES, tmpVal);

  if (NULL != key) {
    if (keyType == SF_CTRL_AES_128BITS) {
      i = 4;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_7,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_6,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_5,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_4,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      */
    } else if (keyType == SF_CTRL_AES_256BITS) {
      i = 8;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_7,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_6,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_5,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_4,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_3,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_2,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_1,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_0,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      */
    } else if (keyType == SF_CTRL_AES_192BITS) {
      i = 6;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_7,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_6,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_5,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_4,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_3,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_2,__REV(BL_RDWD_FRM_BYTEP(key)));
      key+=4;
      */
    }

    tmpVal = SF_CTRL_SF_AES_KEY_7_OFFSET;

    while (i--) {
      BL_WR_WORD(regionRegBase + tmpVal, __REV(BL_RDWD_FRM_BYTEP(key)));
      key += 4;
      tmpVal -= 4;
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Serial flash controller set AES key with big endian
                                                                                *
                                                                                * @param  region: region number
                                                                                * @param  key: key data pointer
                                                                                * @param  keyType: flash controller AES key type:128 bits,192 bits or 256 bits
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Set_Key_BE(uint8_t region, uint8_t *key, SF_Ctrl_AES_Key_Type keyType) {
  /* Do flash key eco*/
  uint32_t regionRegBase = SF_Ctrl_Get_AES_Region(SF_CTRL_BASE, region);
  uint32_t tmpVal, i = 0;

  /* Check the parameters */
  CHECK_PARAM(IS_SF_CTRL_AES_KEY_TYPE(keyType));

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_AES);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_AES_MODE, keyType);
  BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_AES, tmpVal);

  if (NULL != key) {
    if (keyType == SF_CTRL_AES_128BITS) {
      i = 4;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_0,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_1,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_2,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_3,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      */
    } else if (keyType == SF_CTRL_AES_256BITS) {
      i = 8;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_0,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_1,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_2,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_3,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_4,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_5,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_6,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_7,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      */
    } else if (keyType == SF_CTRL_AES_192BITS) {
      i = 6;
      /*
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_0,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_1,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_2,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_3,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_4,BL_RDWD_FRM_BYTEP(key));
      key+=4;
      BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_KEY_5,BL_RDWD_FRM_BYTEP(key));
      */
    }

    tmpVal = SF_CTRL_SF_AES_KEY_0_OFFSET;

