Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sf_ctrl.c
    while (i--) {
      BL_WR_WORD(regionRegBase + tmpVal, BL_RDWD_FRM_BYTEP(key));
      key += 4;
      tmpVal += 4;
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Serial flash controller set AES iv
                                                                                *
                                                                                * @param  region: region number
                                                                                * @param  iv: iv data pointer
                                                                                * @param  addrOffset: flash address offset
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Set_IV(uint8_t region, uint8_t *iv, uint32_t addrOffset) {
  /* Do flash key eco*/
  uint32_t regionRegBase = SF_Ctrl_Get_AES_Region(SF_CTRL_BASE, region);
  uint32_t tmpVal, i = 3;

  if (iv != NULL) {
    tmpVal = SF_CTRL_SF_AES_IV_W3_OFFSET;

    while (i--) {
      BL_WR_WORD(regionRegBase + tmpVal, __REV(BL_RDWD_FRM_BYTEP(iv)));
      iv += 4;
      tmpVal -= 4;
    }

    /*
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W3,__REV(BL_RDWD_FRM_BYTEP(iv)));
    iv+=4;
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W2,__REV(BL_RDWD_FRM_BYTEP(iv)));
    iv+=4;
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W1,__REV(BL_RDWD_FRM_BYTEP(iv)));
    iv+=4;
    */
    BL_WR_REG(regionRegBase, SF_CTRL_SF_AES_IV_W0, addrOffset);
    iv += 4;
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Serial flash controller set AES iv with big endian
                                                                                *
                                                                                * @param  region: region number
                                                                                * @param  iv: iv data pointer
                                                                                * @param  addrOffset: flash address offset
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Set_IV_BE(uint8_t region, uint8_t *iv, uint32_t addrOffset) {
  /* Do flash key eco*/
  uint32_t regionRegBase = SF_Ctrl_Get_AES_Region(SF_CTRL_BASE, region);
  uint32_t tmpVal, i = 3;

  if (iv != NULL) {
    tmpVal = SF_CTRL_SF_AES_IV_W0_OFFSET;

    while (i--) {
      BL_WR_WORD(regionRegBase + tmpVal, BL_RDWD_FRM_BYTEP(iv));
      iv += 4;
      tmpVal += 4;
    }

    /*
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W0,BL_RDWD_FRM_BYTEP(iv));
    iv+=4;
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W1,BL_RDWD_FRM_BYTEP(iv));
    iv+=4;
    BL_WR_REG(regionRegBase,SF_CTRL_SF_AES_IV_W2,BL_RDWD_FRM_BYTEP(iv));
    iv+=4;
    */
    BL_WR_REG(regionRegBase, SF_CTRL_SF_AES_IV_W3, __REV(addrOffset));
    iv += 4;
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable serial flash controller AES
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_AES);
  tmpVal = BL_SET_REG_BIT(tmpVal, SF_CTRL_SF_AES_EN);

  BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_AES, tmpVal);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Disable serial flash controller AES
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_AES_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_AES);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SF_CTRL_SF_AES_EN);

  BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_AES, tmpVal);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Check is serial flash controller AES enable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Wether AES is enable
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint8_t ATTR_TCM_SECTION SF_Ctrl_Is_AES_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_AES);
  return BL_IS_REG_BIT_SET(tmpVal, SF_CTRL_SF_AES_EN);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set flash image offset
                                                                                *
                                                                                * @param  addrOffset: Address offset value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_Set_Flash_Image_Offset(uint32_t addrOffset) { BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_ID0_OFFSET, addrOffset); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  Get flash image offset
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return :Address offset value
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint32_t ATTR_TCM_SECTION SF_Ctrl_Get_Flash_Image_Offset(void) { return BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_ID0_OFFSET); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  SF controller send one command
                                                                                *
                                                                                * @param  sahbType: Serial flash controller clock sahb sram select
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_Select_Clock(SF_Ctrl_Sahb_Type sahbType) {
  uint32_t tmpVal = 0;

  tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_0);

